use crate::alias::Alphabet;
use crate::alphabetize;

pub fn get() -> Alphabet {
    alphabetize! {
        'А' => "A",
        'а' => "a",

        'Б' => "B",
        'б' => "b",

        'В' => "V",
        'в' => "v",

        'Г' => "G",
        'г' => "g",

        'Д' => "D",
        'д' => "d",

        'Е' => "E",
        'е' => "e",

        'Ё' => "Ё",
        'ё' => "ё",

        'Ж' => "Zh",
        'ж' => "zh",

        'З' => "Z",
        'з' => "z",

        'И' => "İ",
        'и' => "i",

        'Й' => "Ĭ",
        'й' => "ĭ",

        'К' => "K",
        'к' => "k",

        'Л' => "L",
        'л' => "l",

        'М' => "M",
        'м' => "m",

        'Н' => "N",
        'н' => "n",

        'О' => "O",
        'о' => "o",

        'П' => "P",
        'п' => "p",

        'Р' => "R",
        'р' => "r",

        'С' => "S",
        'с' => "s",

        'Т' => "T",
        'т' => "t",

        'У' => "U",
        'у' => "u",

        'Ф' => "F",
        'ф' => "f",

        'Х' => "Kh",
        'х' => "kh",

        'Ц' => "T͡s",
        'ц' => "t͡s",

        'Ч' => "Ch",
        'ч' => "ch",

        'Ш' => "Sh",
        'ш' => "sh",

        'Щ' => "Shch",
        'щ' => "shch",

        'Ъ' => "",
        'ъ' => "",

        'Ы' => "Y",
        'ы' => "y",

        'Ь' => "'",
        'ь' => "'",

        'Э' => "Ė",
        'э' => "ė",

        'Ю' => "I͡u",
        'ю' => "i͡u",

        'Я' => "I͡a",
        'я' => "i͡a",
    }
}
